In [2]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [5]:
np.random.seed(101)

In [6]:
d = {'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']}

In [7]:
df = pd.DataFrame(d)

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [15]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [18]:
cols = df.columns

In [20]:
type(cols)

pandas.core.indexes.base.Index

In [35]:
df[cols[1]].unique() #returns the unique items in the column

array([444, 555, 666])

In [25]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [26]:
df[cols[1]].nunique() #returns the number of unique items in a column

3

In [32]:
for i in cols:
    print(i,'\t',df[i].nunique())

col1 	 4
col2 	 3
col3 	 4

In [33]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [42]:
for i in cols:
    print(df[i].value_counts())

4    1
3    1
2    1
1    1
Name: col1, dtype: int64
444    2
555    1
666    1
Name: col2, dtype: int64
def    1
xyz    1
ghi    1
abc    1
Name: col3, dtype: int64

In [43]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [48]:
df[(df['col1']>2) | (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [49]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [50]:
df['col1'].apply(lambda x:x**0.5)

0    1.000000
1    1.414214
2    1.732051
3    2.000000
Name: col1, dtype: float64

In [51]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [56]:
df['col2'].sort_values(ascending = False)

2    666
1    555
3    444
0    444
Name: col2, dtype: int64

In [57]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [58]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [62]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [69]:
d1 = {'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}

In [73]:
df2 = pd.DataFrame(d1)

In [74]:
df2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [76]:
print(df2.pivot_table(values='D',index=['A','B'],columns='C'))

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

#END